app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    #이 부분을 작성하시오.
    @posts = Post.all

INSERT INTO "posts" ("name", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "MyString"], ["title", "MyString"], ["content", "MyText"], ["created_at", 2017-05-14 05:43:10 UTC], ["updated_at", 2017-05-14 05:43:10 UTC]]
---
  def create
    #이 부분을 작성하시오.
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "12342"], ["updated_at", 2017-05-14 08:35:52 UTC], ["id", 980190962]]
---
  def update
    #이 부분을 작성하시오.
    respond_to do |format|
      if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 980190962]]
---
  def destroy
    #이 부분을 작성하시오.
    @post.destroy